skudi/ESP8266MQTTMesh/examples/ESP8266MeshSensor/src/ESP8266MeshSensor.cpp
/*
 *  Copyright (C) 2016 PhracturedBlue
 *
 *  This program is free software: you can redistribute it and/or modify
 *  it under the terms of the GNU General Public License as published by
 *  the Free Software Foundation, either version 3 of the License, or
 *  (at your option) any later version.
 *
 *  This program is distributed in the hope that it will be useful,
 *  but WITHOUT ANY WARRANTY; without even the implied warranty of
 *  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 *  GNU General Public License for more details.
 *
 *  You should have received a copy of the GNU General Public License
 *  along with this program.  If not, see <http://www.gnu.org/licenses/>.
 *
 *  HLW8012 code Copyright (C) 2016-2017 by Xose Pérez <xose dot perez at gmail dot com>
 */
#include <Arduino.h>

/* Sonoff POW w/ DS18B20 attached to GPIO2(SDA) */
#define GREEN_LED   15 //MTDO

#ifndef STATUS_LED
#define STATUS_LED GREEN_LED
#endif

#if HAS_DS18B20
#ifndef DS18B20
#define DS18B20      2 //GPIO2
#endif
#endif

#if HAS_HLW8012
#define HLW8012_SEL  5 //GPIO5
#define HLW8012_CF  14 //MTMS
#define HLW8012_CF1 13 //MTCK
#endif

#ifndef MINHEARBEAT
#define MINHEARBEAT 2000
#endif

struct RelayStruct {
	uint8_t pin; // pin number for digitalWrite()
    uint8_t activeLow:1; // 1 when relay is closed by LOW state (0V)
    uint8_t state:1;     // desired relay state (pin = state xor activeLow) 
};
#define RELAYSPEC(pin, activeLow, state) {pin, activeLow, state}

/* See credentials.h.examle for contents of credentials.h */
#include "credentials.h"
#include "capabilities.h"
#include <ESP8266WiFi.h>
#include <FS.h>
#if HAS_DS18B20
    #include <OneWire.h>
    #include <DallasTemperature.h>
#endif
#if HAS_HLW8012
    #include <HLW8012.h>
#endif

#include <ESP8266MQTTMesh.h>

#define      FIRMWARE_VER       "0.8.2"
const wifi_conn networks[]    = NETWORK_LIST;
const char*  mesh_password    = MESH_PASSWORD;
const mqtt_conn mqtt_servers[]   = MQTT_SERVERS;

#if HAS_DS18B20
OneWire oneWire(DS18B20);
DallasTemperature ds18b20(&oneWire);
DeviceAddress ds18b20Address;
#endif

#if HAS_HLW8012
#define HLW8012_CURRENT_R           0.001
#define HLW8012_VOLTAGE_R_UP        ( 5 * 470000 ) // Real: 2280k
#define HLW8012_VOLTAGE_R_DOWN      ( 1000 ) // Real 1.009k
#define HLW8012_UPDATE_INTERVAL     2000
#define HLW8012_MIN_CURRENT         0.05
#define HLW8012_MIN_POWER           10
HLW8012 hlw8012;
unsigned int power_sum;
unsigned int voltage_sum;
double current_sum;
double energy; //in Watt-Seconds
unsigned long power_sample_count = 0;
bool hlw8012Enabled = false;

void hlw8012_cf1_interrupt();
void hlw8012_cf_interrupt();
void hlw8012_enable_interrupts(bool enabled);
unsigned int hlw8012_getActivePower();
double hlw8012_getCurrent();
unsigned int hlw8012_getVoltage();
#endif

ESP8266MQTTMesh mesh = ESP8266MQTTMesh::Builder(networks, mqtt_servers)
                     .setVersion(FIRMWARE_VER, FIRMWARE_ID)
                     .setMeshPassword(mesh_password)
                     .build();


struct RelayStruct relays[] = RELAYSDEF;
#define RELAYNUM ((sizeof relays)/(sizeof (struct RelayStruct)))

#ifdef BUTTON
bool buttonState = false; //gpio IN button state
#endif
bool stateChanged = false;
int  heartbeat  = 60000;
float temperature = 0.0;

void read_config();
void save_config();
void callback(const char *topic, const char *msg);
String build_json();

void setup() {
    pinMode(STATUS_LED, OUTPUT);
    for (uint8_t i=0; i < RELAYNUM; i++){
        pinMode(relays[i].pin, OUTPUT);
    }
#ifdef BUTTON
    pinMode(BUTTON, INPUT);
    buttonState = digitalRead(BUTTON); //read initial switch state
#endif
    Serial.begin(115200);
    mesh.setCallback(callback);
    mesh.begin();
#if HAS_DS18B20
    ds18b20.begin();
    ds18b20.getAddress(ds18b20Address, 0);
    ds18b20.setWaitForConversion(false);
    ds18b20.requestTemperatures();
#endif
#if HAS_HLW8012
    Serial.println("HLW8012 start");
    hlw8012.begin(HLW8012_CF, HLW8012_CF1, HLW8012_SEL, HIGH, true);
    hlw8012.setResistors(HLW8012_CURRENT_R, HLW8012_VOLTAGE_R_UP, HLW8012_VOLTAGE_R_DOWN);
    Serial.println("HLW8012 end");
#endif
    //mesh.setup will initialize the filesystem
    if (SPIFFS.exists("/config")) {
        read_config();
    }
    Serial.println("config end");
    for (uint8_t i=0; i < RELAYNUM; i++){
        digitalWrite(relays[i].pin, relays[i].state ^ relays[i].activeLow);
    }
	digitalWrite(STATUS_LED, !relays[0].state);
}


void loop() {
    static unsigned long prevButtonChange = 0;
    static unsigned long lastSend = 0;
    static bool needToSend = false;
		static unsigned long blinkOffTime = 0;

    unsigned long now = millis();

		if ( blinkOffTime && (now > blinkOffTime) ) {
			//blink end
			digitalWrite(STATUS_LED, !relays[0].state);
			blinkOffTime = 0;
		}

#if HAS_DS18B20
    if (ds18b20.isConversionComplete()) {
        temperature = ds18b20.getTempC(ds18b20Address);
        ds18b20.requestTemperatures();
    }    
#endif

#if HAS_HLW8012
    if (! hlw8012Enabled && mesh.connected()) {
        hlw8012_enable_interrupts(true);
    } else if (hlw8012Enabled && ! mesh.connected()) {
        hlw8012_enable_interrupts(false);
    }
    static unsigned long last_hlw8012_update = 0;
    if (now - last_hlw8012_update > HLW8012_UPDATE_INTERVAL) {
        static unsigned int power[3] = {0};
        static unsigned int voltage[3] = {0};
        static double current[3] = {0};
        for (int i = 0; i < 2; i++) {
            power[i] = power[i+1];
            voltage[i] = voltage[i+1];
            current[i] = current[i+1];
        }
        power[2]    = hlw8012_getActivePower();
        voltage[2]  = hlw8012_getVoltage();
        current[2]  = hlw8012_getCurrent();

        //Spike removal
        if (power[1] > 0 && power[0] == 0 && power[2] == 0) {
            power[1] = 0;
        }
        if (current[1] > 0 && current[0] == 0 && current[2] == 0) {
            current[1] = 0;
        }
        if (voltage[1] > 0 && voltage[0] == 0 && voltage[2] == 0) {
            voltage[1] = 0;
        }
        power_sum += power[0];
        current_sum += current[0];
        voltage_sum += voltage[0];
        energy += 1.0 * power[0] * (now - last_hlw8012_update) / 1000.0;
        power_sample_count++;
        last_hlw8012_update = now;
    }
#endif

#ifdef FREEZER
	if ( temperature != -127.0 ) {
		if ( (temperature > TEMPMAX) && (relays[0].state == 0) ) {
			relays[0].state = 1;
			stateChanged = true;
		} else if ( (temperature < TEMPMIN) && (relays[0].state == 1) ) {
			relays[0].state = 0;
			stateChanged = true;
		} else {
			stateChanged = false;
		}
	}
#endif

#ifdef BUTTON
#ifdef BISTATEBUTTON
    if (buttonState != digitalRead(BUTTON))  {
#else
    if (! digitalRead(BUTTON))  {
#endif
	    //debounce delay
        if(prevButtonChange == 0) {
		    //toggle relay state
		    buttonState = digitalRead(BUTTON);
            relays[0].state = !relays[0].state;
            stateChanged = true;
        }
        prevButtonChange = now;
    } else if (prevButtonChange && now - prevButtonChange > 50) {
        prevButtonChange = 0;
    }
    if (stateChanged) {
        digitalWrite(relays[0].pin, relays[0].state ^ relays[0].activeLow);
        digitalWrite(STATUS_LED, !relays[0].state);
        save_config();
        needToSend = true;
        stateChanged = false;
    }
#else
    if (stateChanged) {
        save_config();
        stateChanged = false;
    }
#endif

    if (now - lastSend > heartbeat) {
        needToSend = true;
    }
    if (! mesh.connected()) {
        return;
    }
    if (needToSend) {
        lastSend = now;
        String data = build_json();
#if HAS_HLW8012
        power_sum = 0;
        current_sum = 0;
        voltage_sum = 0;
        power_sample_count = 0;
#endif
        mesh.publish("status", data.c_str());
        needToSend = false;
		digitalWrite(STATUS_LED, relays[0].state); //toggle LED for blinkOffTime
		blinkOffTime = now + 100;
    }   
}

void callback(const char *topic, const char *msg) {
    if (0 == strcmp(topic, "heartbeat")) {
       unsigned int hb = strtoul(msg, NULL, 10);
       if (hb > MINHEARBEAT) {
           heartbeat = hb;
           save_config();
       }
    } else if (strstr(topic, "relay") == topic) {
        //accept "relay" - relay0
        // and "relay/#" - relay#
        char * relayIdxTxt = strrchr(topic, '/' );
        uint8_t relayIdx = 0;
        if (relayIdxTxt != NULL) {
            relayIdx = atoi(relayIdxTxt+1);
        }
        if (relayIdx >= RELAYNUM) {
            relayIdx = 0;
        }
       bool nextState = strtoul(msg, NULL, 10) ? true : false;
       if (relays[relayIdx].state != nextState) {
           relays[relayIdx].state = nextState;
           digitalWrite(relays[relayIdx].pin, relays[relayIdx].state ^ relays[relayIdx].activeLow);
           stateChanged = true;
       }
    } else if (strstr(topic, "config/read") == topic) {
        read_config();
    }
#if HAS_HLW8012
    else if (0 == strcmp(topic, "expectedpower")) {
       int pow = atoi(msg);
       if (pow > 0) {
           hlw8012.expectedActivePower(pow);
           save_config();
       }
    }
    else if (0 == strcmp(topic, "expectedvoltage")) {
       int volt = atoi(msg);
       if (volt > 0) {
           hlw8012.expectedVoltage(volt);
           save_config();
       }
    }
    else if (0 == strcmp(topic, "expectedcurrent")) {
       double current = atof(msg);
       if (current > 0) {
           hlw8012.expectedCurrent(current);
           save_config();
       }
    }
    else if (0 == strcmp(topic, "resetpower")) {
       int state = atoi(msg);
       if (state > 0) {
           hlw8012.resetMultipliers();
           save_config();
       }
    }
#endif //HAS_HLW8012
}

String build_json() {
    String msg = "{ \"v\":\"1\"";
    #ifdef BUTTON
    msg += ", \"buttons\":{";
    msg += "\"0\":\"" + String(digitalRead(BUTTON) ? "1" : "0") + "\"";
    msg += "}";
    #endif
    msg += ", \"relays\":{";
    for (uint8_t i=0; i < RELAYNUM; i++) {
        if (i>0) { msg+= ",";}
        msg += "\"" + String(i) + "\":\"" + (relays[i].state ? "1" : "0") + "\"";
    }
    msg += "}";
#if HAS_DS18B20
        msg += ", \"temp0\":" + String(temperature, 2);
#endif
#if HAS_HLW8012
        double count = power_sample_count ? power_sample_count : 1;
        double power   = (double)power_sum / count;
        double current = (double)current_sum / count;
        double voltage = (double)voltage_sum / count;
        double apparent= voltage * current;
        double pfactor = (apparent > 0) ? 100 * power / apparent : 100;
        if (pfactor > 100) {
            pfactor = 100;
        }
        msg += ", \"power\":" + String(power, 3);
        msg += ", \"current\":" + String(current, 3);
        msg += ", \"voltage\":" + String(voltage, 3);
        msg += ", \"pf\":" + String(pfactor, 3);
        msg += ", \"energy\":" + String(energy / 3600, 3);      //Watt-Hours
#endif
    msg += "}";
    return msg;
}

void read_config() {
    File f = SPIFFS.open("/config", "r");
    if (! f) {
        Serial.println("Failed to read config");
        return;
    }
    while(f.available()) {
        char s[32];
        char key[32];
        const char *value;
        s[f.readBytesUntil('\n', s, sizeof(s)-1)] = 0;
        if (mesh.connected()) {
            mesh.publish("config", s);
        }
        if (! ESP8266MQTTMesh::keyValue(s, '=', key, sizeof(key), &value)) {
            continue;
        }
        if (strstr(key, "RELAY") == key) {
            // RELAY or RELAY#
            uint8_t relayIdx = 0;
            if (strlen(key) > strlen("RELAY")) {
                relayIdx = atoi(key + strlen("RELAY"));
            }
            relays[relayIdx].state = value[0] == '0' ? 0 : 1;
        }
        else if (0 == strcmp(key, "HEARTBEAT")) {
            heartbeat = atoi(value);
            if (heartbeat < 1000) {
                heartbeat = 1000;
            } else if (heartbeat > 60 * 60 * 1000) {
                heartbeat = 5 * 60 * 1000;
            }
        }
#if HAS_HLW8012
        else if  (0 == strcmp(key, "hlw8012PowerMult")) {
            double dbl = atof(value);
            if (dbl > 0) hlw8012.setPowerMultiplier(dbl);
             
        }
        else if  (0 == strcmp(key, "hlw8012CurrentMult")) {
            double dbl = atof(value);
            if (dbl > 0) hlw8012.setCurrentMultiplier(dbl);
        }
        else if  (0 == strcmp(key, "hlw8012VoltageMult")) {
            double dbl = atof(value);
            if (dbl > 0) hlw8012.setVoltageMultiplier(dbl);
        }
#endif //HAS_HLW8012
    }
    f.close();
}

void save_config() {
    File f = SPIFFS.open("/config", "w");
    if (! f) {
        Serial.println("Failed to write config");
        return;
    }
    for (uint8_t i=0; i < RELAYNUM; i++) {
        f.print("RELAY" + String(i) + "=" + (relays[i].state ? "1" : "0") + "\n");
    }
    f.print("HEARTBEAT=" + String(heartbeat) + "\n");
#if HAS_HLW8012
    f.print("hlw8012PowerMult="   + String(hlw8012.getPowerMultiplier()));
    f.print("hlw8012CurrentMult=" + String(hlw8012.getCurrentMultiplier()));
    f.print("hlw8012VoltageMult=" + String(hlw8012.getVoltageMultiplier()));
#endif
    f.close();
}


// When using interrupts we have to call the library entry point
// whenever an interrupt is triggered
#if HAS_HLW8012
void hlw8012_cf1_interrupt() {
    hlw8012.cf1_interrupt();
}

void hlw8012_cf_interrupt() {
    hlw8012.cf_interrupt();
}
void hlw8012_enable_interrupts(bool enabled) {
    if (enabled) {
        attachInterrupt(HLW8012_CF1, hlw8012_cf1_interrupt, CHANGE);
        attachInterrupt(HLW8012_CF,  hlw8012_cf_interrupt,  CHANGE);
        hlw8012Enabled = true;
    } else {
        detachInterrupt(HLW8012_CF1);
        detachInterrupt(HLW8012_CF);
        hlw8012Enabled = false;
    }
}
unsigned int hlw8012_getActivePower() {
    unsigned int power = hlw8012.getActivePower();
    if (power < HLW8012_MIN_POWER) power = 0;
    return power;
}

double hlw8012_getCurrent() {
    double current = hlw8012.getCurrent();
    if (current < HLW8012_MIN_CURRENT) current = 0;
    return current;
}

unsigned int hlw8012_getVoltage() {
    return hlw8012.getVoltage();
}
#endif
